#include <iostream>
#include <string>
#include <algorithm>
using namespace std;

int main()
{
    int x;
    string E[10]{" ", " один", " два", " три", " четыре", " пять" ," шесть", " семь", " восемь" ," девять"};
    string D[10]{" ", "десять", "двадцать"," тридцать", "cорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string M[20]{" ", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    string S[11]{" ", "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шетьсот ", "семьсот ", "восемьсот ", "девятьсот "};
    cout << "Введите число в пределах 100-999: ";
    cin >> x;
    int a = x / 100;
    int b = x / 10 % 10;
    int c = x % 10;
    if (b == 0){
        if (c == 0){
            cout << S[a];
        }
        else{
        cout << S[a] << E[c];
        }
    }
    else if(c == 0){
        cout << S[a] << D[b];
    }
    else if (b > 1){
        cout << S[a] << D[b] << E[c];
    }
    else{
        cout << S[a] << M[c];
    };
    return 0;
}