#include <iostream>
#include <string>
#include <algorithm>
using namespace std;

int main()
{
    int x;
    string UchZad[3]{" учебных заданий", " учебное задание", " учебных задания"};
    string P[31]{"Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать", "Шестнадцать", "Семнадцать", "Восемнадцать", "Девятнадцать", "Двадцать", "Двадцать одно", "Двадцать два", "Двадцать три", "Двадцать четыре", "Двадцать пять", "Двадцать шесть", "Двадцать семь", "Двадцать восемь", "Двадцать девять", "Тридцать", "Тридцать одно", "Тридцать два", "Тридцать три", "Тридцать четыре" "Тридцать пять", "Тридцать шесть", "Тридцать семь", "Тридцать восемь", "Тридцать девять", "Сорок"};
    cout << "Введите количество учебных заданий цифрой 10-40: ";
    cin >> x;
    int i = x - 10;
    if (((x >= 10) && (x <= 20)) || ((x >= 25) && (x <= 30)) || ((x >= 35) && (x <= 40))){
        cout << P[i] << UchZad[0];
    };
    if ((x == 21) || (x == 31)){
        cout << P[i] << UchZad[1];
    };
    if (((x >= 22) && (x <= 24)) || ((x >= 32) && (x <= 34))){
        cout << P[i] << UchZad[2];
    };
    return 0;
}