#include <iostream>
#include <string>
#include <algorithm>
using namespace std;

int main()
{
    string M[13] = {" ", "января.", "февраля.", "марта.", "апреля.", "мая.", "июня.", "июля.", "августа.", "сентября.", "октября.", "ноября.", "декабря."};
	string N[32] = {" ", "Первое", "Второе", "Третье", "Четвёртое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое", "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвёртое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое", "Тридцать первое"};
	int n, m;
	cout << "Введите число: ";
	cin >> n;
	cout << "Введите номер месяца: ";
	cin >> m;
    if ((n > 29) && (m == 2)){
		cout <<"В феврале максимум 29 дней.";
	}
	else {
		cout << N[n] << " " << M[m]; 
	}
    return 0;
}