#include <iostream>
#include <string>
#include <algorithm>
using namespace std;

int main()
{
    int x;
    string Col[5]{"зеленой ", "красной ", "желтой ", "белой ", "черной "};
    string Colm[5]{"зеленого ", "красного ", "желтого ", "белого ", "черного "};
    string Zh[12]{"крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезьяны", "курицы", "собаки", "свиньи"};
    cout << "Введите год от 1984 до 2044: ";
    cin >> x;
    if ((x >= 1984) && (x < 1996)){
        if (((x - 1984) != 2) && ((x - 1984) != 3) && ((x - 1984) != 4)){
           cout << "Год " << Col[0] << Zh[x - 1984]; 
        }
        else{
            cout << "Год " << Colm[0] << Zh[x - 1984];
        }
    }
    else if ((x >= 1996) && (x < 2008)){
        if (((x - 1996) != 2) && ((x - 1996) != 3) && ((x - 1996) != 4)){
           cout << "Год " << Col[1] << Zh[x - 1996]; 
        }
        else{
            cout << "Год " << Colm[1] << Zh[x - 1996];
        }
    }
    else if ((x >= 2008) && (x < 2020)){
        if (((x - 2008) != 2) && ((x - 2008) != 3) && ((x - 2008) != 4)){
           cout << "Год " << Col[2] << Zh[x - 2008]; 
        }
        else{
            cout << "Год " << Colm[2] << Zh[x - 2008];
        }
    }
    else if ((x >= 2020) && (x < 2032)){
        if (((x - 2020) != 2) && ((x - 2020) != 3) && ((x - 2020) != 4)){
           cout << "Год " << Col[3] << Zh[x - 2020]; 
        }
        else{
            cout << "Год " << Colm[3] << Zh[x - 2020];
        }
    }
    else if ((x >= 2032) && (x < 2044)){
        if (((x - 2032) != 2) && ((x - 2032) != 3) && ((x - 2032) != 4)){
           cout << "Год " << Col[4] << Zh[x - 2032]; 
        }
        else{
            cout << "Год " << Colm[4] << Zh[x - 2032];
        }
    };
    return 0;
}
